create_clock -name clk -period 15 -waveform {0 7.5} [get_ports clk]
set_clock_uncertainty -setup 0.1 [get_clocks clk]
set_clock_uncertainty -hold 0  [get_clocks clk]
set_clock_transition 0.15 [get_clocks clk]
set_input_delay -clock clk -max 2 [get_ports rst]
set_input_delay -clock clk -max 2 [get_ports wr_en]
set_input_delay -clock clk -max 2 [get_ports rd_en]
set_input_delay -clock clk -max 2 [get_ports {din[*]}]
set_output_delay -clock clk -max 2 [get_ports {dout[*]}]
set_output_delay -clock clk -max 2 [get_ports full]
set_output_delay -clock clk -max 2 [get_ports empty]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin X -min [all_inputs]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_2 -pin X -max [all_inputs]
set_load -max 0.02 [all_outputs]
set_load -min 0.01 [all_outputs]
